architectual__recovery/scripts/classes.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"zeeguu.core.model.article.Article" [color="black", fontcolor="black", label=<Article>, shape="record", style="solid"];
"zeeguu.core.model.article_difficulty_feedback.ArticleDifficultyFeedback" [color="black", fontcolor="black", label=<ArticleDifficultyFeedback>, shape="record", style="solid"];
"zeeguu.core.model.article_word.ArticleWord" [color="black", fontcolor="black", label=<ArticleWord>, shape="record", style="solid"];
"zeeguu.core.model.articles_cache.ArticlesCache" [color="black", fontcolor="black", label=<ArticlesCache>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.automatic_gec_tagging.AutoGECTagging" [color="black", fontcolor="black", label=<AutoGECTagging>, shape="record", style="solid"];
"zeeguu.core.word_scheduling.basicSR.basicSR.BasicSRSchedule" [color="black", fontcolor="black", label=<BasicSRSchedule>, shape="record", style="solid"];
"zeeguu.core.model.bookmark.Bookmark" [color="black", fontcolor="black", label=<Bookmark>, shape="record", style="solid"];
"zeeguu.core.model.bookmark_priority_arts.BookmarkPriorityARTS" [color="black", fontcolor="black", label=<BookmarkPriorityARTS>, shape="record", style="solid"];
"zeeguu.core.language.strategies.cognacy_difficulty_estimator.CognacyDifficultyEstimator" [color="black", fontcolor="black", label=<CognacyDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.language.strategies.cognacy_wh_difficulty_estimator.CognacyWordHistoryDifficultyEstimator" [color="black", fontcolor="black", label=<CognacyWordHistoryDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.model.cohort.Cohort" [color="black", fontcolor="black", label=<Cohort>, shape="record", style="solid"];
"zeeguu.core.model.cohort_article_map.CohortArticleMap" [color="black", fontcolor="black", label=<CohortArticleMap>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.confusion_set.ConfusionSet" [color="black", fontcolor="black", label=<ConfusionSet>, shape="record", style="solid"];
"zeeguu.core.language.strategies.default_difficulty_estimator.DefaultDifficultyEstimator" [color="black", fontcolor="black", label=<DefaultDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.language.difficulty_estimator_factory.DifficultyEstimatorFactory" [color="black", fontcolor="black", label=<DifficultyEstimatorFactory>, shape="record", style="solid"];
"zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [color="black", fontcolor="black", label=<DifficultyEstimatorStrategy>, shape="record", style="solid"];
"zeeguu.core.model.difficulty_lingo_rank.DifficultyLingoRank" [color="black", fontcolor="black", label=<DifficultyLingoRank>, shape="record", style="solid"];
"zeeguu.core.model.domain_name.DomainName" [color="black", fontcolor="black", label=<DomainName>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.alignment_errant.ERRANT_Alignment" [color="black", fontcolor="black", label=<ERRANT_Alignment>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.edit_errant.Edit" [color="black", fontcolor="black", label=<Edit>, shape="record", style="solid"];
"zeeguu.core.model.exercise.Exercise" [color="black", fontcolor="black", label=<Exercise>, shape="record", style="solid"];
"zeeguu.core.model.exercise_outcome.ExerciseOutcome" [color="black", fontcolor="black", label=<ExerciseOutcome>, shape="record", style="solid"];
"zeeguu.core.model.exercise_source.ExerciseSource" [color="black", fontcolor="black", label=<ExerciseSource>, shape="record", style="solid"];
"zeeguu.core.language.strategies.flesch_kincaid_difficulty_estimator.FleschKincaidDifficultyEstimator" [color="black", fontcolor="black", label=<FleschKincaidDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.language.strategies.frequency_difficulty_estimator.FrequencyDifficultyEstimator" [color="black", fontcolor="black", label=<FrequencyDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.util.encoding.JSONSerializable" [color="black", fontcolor="black", label=<JSONSerializable>, shape="record", style="solid"];
"zeeguu.core.model.language.Language" [color="black", fontcolor="black", label=<Language>, shape="record", style="solid"];
"zeeguu.core.model.localized_topic.LocalizedTopic" [color="black", fontcolor="black", label=<LocalizedTopic>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.confusion_generator.NoiseGenerator" [color="black", fontcolor="black", label=<NoiseGenerator>, shape="record", style="solid"];
"zeeguu.core.model.personal_copy.PersonalCopy" [color="black", fontcolor="black", label=<PersonalCopy>, shape="record", style="solid"];
"zeeguu.core.model.feed.RSSFeed" [color="black", fontcolor="black", label=<RSSFeed>, shape="record", style="solid"];
"zeeguu.core.model.search.Search" [color="black", fontcolor="black", label=<Search>, shape="record", style="solid"];
"zeeguu.core.model.search_filter.SearchFilter" [color="black", fontcolor="black", label=<SearchFilter>, shape="record", style="solid"];
"zeeguu.core.model.search_subscription.SearchSubscription" [color="black", fontcolor="black", label=<SearchSubscription>, shape="record", style="solid"];
"zeeguu.core.model.session.Session" [color="black", fontcolor="black", label=<Session>, shape="record", style="solid"];
"zeeguu.core.content_retriever.article_downloader.SkippedAlreadyInDB" [color="black", fontcolor="red", label=<SkippedAlreadyInDB>, shape="record", style="solid"];
"zeeguu.core.content_retriever.article_downloader.SkippedForLowQuality" [color="black", fontcolor="red", label=<SkippedForLowQuality>, shape="record", style="solid"];
"zeeguu.core.content_retriever.article_downloader.SkippedForTooOld" [color="black", fontcolor="red", label=<SkippedForTooOld>, shape="record", style="solid"];
"zeeguu.core.model.sorted_exercise_log.SortedExerciseLog" [color="black", fontcolor="black", label=<SortedExerciseLog>, shape="record", style="solid"];
"zeeguu.core.nlp_pipeline.spacy_wrapper.SpacyWrapper" [color="black", fontcolor="black", label=<SpacyWrapper>, shape="record", style="solid"];
"zeeguu.core.model.starred_article.StarredArticle" [color="black", fontcolor="black", label=<StarredArticle>, shape="record", style="solid"];
"zeeguu.core.model.teacher.Teacher" [color="black", fontcolor="black", label=<Teacher>, shape="record", style="solid"];
"zeeguu.core.model.teacher_cohort_map.TeacherCohortMap" [color="black", fontcolor="black", label=<TeacherCohortMap>, shape="record", style="solid"];
"zeeguu.core.model.text.Text" [color="black", fontcolor="black", label=<Text>, shape="record", style="solid"];
"zeeguu.core.model.topic.Topic" [color="black", fontcolor="black", label=<Topic>, shape="record", style="solid"];
"zeeguu.core.model.topic_filter.TopicFilter" [color="black", fontcolor="black", label=<TopicFilter>, shape="record", style="solid"];
"zeeguu.core.model.topic_subscription.TopicSubscription" [color="black", fontcolor="black", label=<TopicSubscription>, shape="record", style="solid"];
"zeeguu.core.model.unique_code.UniqueCode" [color="black", fontcolor="black", label=<UniqueCode>, shape="record", style="solid"];
"zeeguu.core.model.url.Url" [color="black", fontcolor="black", label=<Url>, shape="record", style="solid"];
"zeeguu.core.model.user.User" [color="black", fontcolor="black", label=<User>, shape="record", style="solid"];
"zeeguu.core.model.user_activitiy_data.UserActivityData" [color="black", fontcolor="black", label=<UserActivityData>, shape="record", style="solid"];
"zeeguu.core.model.user_article.UserArticle" [color="black", fontcolor="black", label=<UserArticle>, shape="record", style="solid"];
"zeeguu.core.model.user_exercise_session.UserExerciseSession" [color="black", fontcolor="black", label=<UserExerciseSession>, shape="record", style="solid"];
"zeeguu.core.model.user_language.UserLanguage" [color="black", fontcolor="black", label=<UserLanguage>, shape="record", style="solid"];
"zeeguu.core.model.user_preference.UserPreference" [color="black", fontcolor="black", label=<UserPreference>, shape="record", style="solid"];
"zeeguu.core.model.user_reading_session.UserReadingSession" [color="black", fontcolor="black", label=<UserReadingSession>, shape="record", style="solid"];
"zeeguu.core.model.user_word.UserWord" [color="black", fontcolor="black", label=<UserWord>, shape="record", style="solid"];
"zeeguu.core.model.smartwatch.watch_event_type.WatchEventType" [color="black", fontcolor="black", label=<WatchEventType>, shape="record", style="solid"];
"zeeguu.core.model.smartwatch.watch_interaction_event.WatchInteractionEvent" [color="black", fontcolor="black", label=<WatchInteractionEvent>, shape="record", style="solid"];
"zeeguu.core.language.strategies.word_history_difficulty_estimator.WordHistoryDifficultyEstimator" [color="black", fontcolor="black", label=<WordHistoryDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.model.word_knowledge.word_interaction_history.WordInteractionEvent" [color="black", fontcolor="black", label=<WordInteractionEvent>, shape="record", style="solid"];
"zeeguu.core.model.word_knowledge.word_interaction_history.WordInteractionHistory" [color="black", fontcolor="black", label=<WordInteractionHistory>, shape="record", style="solid"];
"zeeguu.core.language.strategies.word_rank_difficulty_estimator.WordRankDifficultyEstimator" [color="black", fontcolor="black", label=<WordRankDifficultyEstimator>, shape="record", style="solid"];
"zeeguu.core.model.word_to_study.WordToStudy" [color="black", fontcolor="black", label=<WordToStudy>, shape="record", style="solid"];
"zeeguu.core.emailer.zeeguu_mailer.ZeeguuMailer" [color="black", fontcolor="black", label=<ZeeguuMailer>, shape="record", style="solid"];
"zeeguu.core.language.strategies.cognacy_difficulty_estimator.CognacyDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.cognacy_wh_difficulty_estimator.CognacyWordHistoryDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.default_difficulty_estimator.DefaultDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.flesch_kincaid_difficulty_estimator.FleschKincaidDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.frequency_difficulty_estimator.FrequencyDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.word_history_difficulty_estimator.WordHistoryDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.word_rank_difficulty_estimator.WordRankDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_strategy.DifficultyEstimatorStrategy" [arrowhead="empty", arrowtail="none"];
"zeeguu.core.language.strategies.default_difficulty_estimator.DefaultDifficultyEstimator" -> "zeeguu.core.language.difficulty_estimator_factory.DifficultyEstimatorFactory" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="_default_estimator", style="solid"];
"zeeguu.core.model.domain_name.DomainName" -> "zeeguu.core.model.url.Url" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="domain", style="solid"];
"zeeguu.core.model.user.User" -> "zeeguu.core.model.user_preference.UserPreference" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="user", style="solid"];
"zeeguu.core.model.user.User" -> "zeeguu.core.model.word_knowledge.word_interaction_history.WordInteractionHistory" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="user", style="solid"];
"zeeguu.core.model.user_word.UserWord" -> "zeeguu.core.model.bookmark.Bookmark" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="origin", style="solid"];
"zeeguu.core.model.user_word.UserWord" -> "zeeguu.core.model.bookmark.Bookmark" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="translation", style="solid"];
"zeeguu.core.model.user_word.UserWord" -> "zeeguu.core.model.word_knowledge.word_interaction_history.WordInteractionHistory" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="word", style="solid"];
}
